import random

class Advisor:
    def __init__(self):
        self.advices = [
            "منابع طلای شما در حال اتمام است. معدن طلا را توسعه دهید.",
            "ارتش نیاز به تقویت دارد. سربازان بیشتری استخدام کنید.",
            "به دنبال متحدان قوی باشید تا امنیت شما افزایش یابد.",
            "اقتصاد خود را تقویت کنید تا قدرت بیشتری داشته باشید.",
            "از حمله به دشمنان ضعیف غافل نشوید.",
            "همیشه آماده دفاع از سرزمین خود باشید.",
            "تجارت با کشورهای دیگر می‌تواند سودآور باشد.",
            "سطح دفاعی خود را افزایش دهید.",
        ]
    
    def get_advice(self):
        return random.choice(self.advices)
